module.exports = {
    config: {
        name: "botinfo",
        owner: "MOHAMMAD-BADOL",
        aliases: ["info", "aboutbot"],
        description: "Show bot features and info",
        usage: "/botinfo"
    },

    onStart: async ({ bot, msg, args }) => {
        const botInfoMessage = `
╭━─━─━❮✨ 𝐁𝐀𝐃𝐎𝐋-𝐁𝐎𝐓 ✨❯━─━─━╮
├‣ 𝐁𝐨𝐭 𝐍𝐚𝐦𝐞: 𝐁𝐀𝐃𝐎𝐋-𝐁𝐎𝐓
├‣ 𝐏𝐫𝐞𝐟𝐢𝐱: /
├‣ 𝐏𝐥𝐚𝐭𝐟𝐨𝐫𝐦: node-telegram-bot-api
├‣ 𝐂𝐨𝐝𝐞𝐝 𝐁𝐲: 𝐌𝐨𝐡𝐚𝐦𝐦𝐚𝐝 𝐁𝐚𝐝𝐨𝐥
├‣ 𝐕𝐞𝐫𝐬𝐢𝐨𝐧: 𝟏.𝟎.𝟎
╰━──━─━─━━──━─━─━─━❍

╭━─━─━❮✨ 𝐁𝐨𝐭 𝐅𝐞𝐚𝐭𝐬 ✨❯━─━─━╮
├‣ ✔ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 (modular)
├‣ ✔ 𝐏𝐫𝐞𝐟𝐢𝐱 + 𝐖𝐢𝐭𝐡𝐨𝐮𝐭 𝐏𝐫𝐞𝐟𝐢𝐱
├‣ ✔ 𝐀𝐮𝐭𝐨 𝐒𝐮𝐠𝐠𝐞𝐬𝐭𝐢𝐨𝐧
├‣ ✔ 𝐄𝐯𝐞𝐧𝐭𝐬 & 𝐨𝐧𝐂𝐡𝐚𝐭
├‣ ✔ 𝐕𝐞𝐫𝐢𝐟𝐲 𝐒𝐲𝐬𝐭𝐞𝐦
├‣ ✔ 𝐒𝐮𝐛𝐬𝐜𝐫𝐢𝐛𝐞𝐫𝐬
├‣ ✔ 𝐆𝐢𝐭𝐇𝐮𝐛 𝐁𝐚𝐧 𝐒𝐲𝐬𝐭𝐞𝐦
├‣ ✔ 𝐀𝐝𝐦𝐢𝐧 𝐍𝐨𝐭𝐢𝐟𝐢𝐜𝐚𝐭𝐢𝐨𝐧
├‣ ✔ 𝐌𝐢𝐝𝐝𝐥𝐞𝐰𝐚𝐫𝐞𝐬:
│   ├‣ ⏰ 𝐀𝐮𝐭𝐨𝐓𝐢𝐦𝐞
│   ├‣ 🗣 𝐀𝐥𝐥 𝐌𝐞𝐧𝐭𝐢𝐨𝐧
│   ├‣ 🚫 𝐀𝐧𝐭𝐢𝐋𝐢𝐧𝐤
│   ├‣ ❤️ 𝐀𝐮𝐭𝐨𝐑𝐞𝐚𝐜𝐭
│   └‣ ✅ 𝐕𝐞𝐫𝐢𝐟𝐲 𝐆𝐫𝐨𝐮𝐩
╰━──━─━─━━──━━─━━─━━─━❍
        `;

        return bot.sendMessage(msg.chat.id, botInfoMessage, {
            reply_to_message_id: msg.message_id
        });
    }
};



